app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 207281424], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-01-24 11:03:49.562092"], ["updated_at", "2020-01-24 11:03:49.562092"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 207281424], ["cart_id", 980190963], ["created_at", "2020-01-24 11:03:49.586732"], ["updated_at", "2020-01-24 11:03:49.586732"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2020-01-24 10:46:47.793506"], ["id", 1]]
---
  def create
      product = Product.find(params[:product_id])
      @line_item = @cart.add_product(product)
      respond_to do |format|
        if @line_item.save