app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-01-28 12:35:39.361921"], ["updated_at", "2020-01-28 12:35:39.361921"]]
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Dave Thomas"], ["address", "MyText"], ["email", "dave@example.org"], ["pay_type", 0], ["created_at", "2020-01-28 12:35:39.369587"], ["updated_at", "2020-01-28 12:35:39.369587"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190963]]