app/controllers/products_controller.rb

  def update
    respond_to do |format|
      if @product.update(product_params)
        format.html { redirect_to @product, notice: 'Product was successfully updated.' }
        format.json { render :show, status: :ok, location: @product }

        @products = Product.all
---
UPDATE "products" SET "title" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "The Great Book 766"], ["updated_at", "2020-01-24 11:03:49.710682"], ["id", 980190962]]
SELECT "products".* FROM "products"

  def who_bought
    @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]